**DL2001 - Introduction to Data Science Lab - Midterm Exam - Fall 2024** <br>
Please note:
- Total marks are 40
- Total Question are 9
- No internet or helping material is allowed
- You are NOT allowed to take any smart gadget (Mobile, smart watch etc.). If found, your exam will be canceled
- Please submit your code on Cactus.
- Add #Roll_Number as filename and download the .ipynb file, submit the file.
- Cases of plagiarism, use of AI, unfair means like placing lab solution in the system and copying code from it or use of mobile phone will result in straight zero without any chance to defend along with dc.
- The allowed time is **2 hours**

**Question 1:**
Imagine you’re organizing a music playlist for a party and have a library of songs with their durations (in minutes). Create a **Dictionary** where song titles are the keys, and their durations (as floats) are the values. Write a Python program that prompts the user to enter multiple song titles (comma-separated). For each song title, check if it exists in the dictionary. If it exists, print the duration; if it doesn't, print "Song not found." At the end, calculate and display the total duration of all the songs found. If no valid songs are entered, print "No valid songs found."

**(Marks:5)**

**Song Title	               Duration (min)**

"Blinding Lights" =	             3.5
"Levitating"	     =            3.2
"Peaches"	          =           3.1
"Save Your Tears"	   =          3.6
"Rain Drops"	      =         4.0

Sample Output:


```
Enter song titles (comma-separated): Peaches, Blinding Lights, Stay
The duration of "Peaches" is 3.1 minutes
The duration of "Blinding Lights" is 3.5 minutes
Song "Stay" not found.
Total duration of the valid songs: 6.6 minutes
```

In [2]:
import numpy as np
import pandas as pd
from scipy import stats

In [2]:
# Q1
songs = {
    "Blinding Lights": 3.5,
    "Save Your Tears": 3.6,
    "Rain Drops": 4.0,
    "Levitating": 3.2,
    "Peaches": 3.1,
}
s = input("Enter song titles (comma-separated): ")
title = [title.strip() for title in s.split(",")]
bool_found = False
final = 0.0
for title in title:
    if title in songs:
        print(f'The duration of "{title}" is {songs[title]} minutes')
        final = final + songs[title]
        bool_found = True
    else:
        print(f'Song "{title}" not found.')

if bool_found:
    print(f"Total duration of the valid songs: {final} minutes")
else:
    print("No valid songs.")

Enter song titles (comma-separated): Blinding Lights, Stay
The duration of "Blinding Lights" is 3.5 minutes
Song "Stay" not found.
Total duration of the valid songs: 3.5 minutes

**Question 2: Numpy array**
You’re working with a student grading system where each student has a unique identifier. Create a 1D array of 15 random scores between 1 and 100 to represent the test scores of 15 students. Then, organize these scores into a 5x3 matrix, where each row represents a different class with 3 students. Display both the original 1D array of scores and the reshaped matrix.

 **`(Marks: 3)`**

In [3]:
# Q2
s = np.random.randint(1, 101, size=15)
print("Original 1D array:")
print(s)
reshape_s = s.reshape(5, 3)
print("Reshaped 5x3 matrix:")
print(reshape_s)

Original 1D array:
[48  1 60  6 44 47  5 68 90 46 90 64 37 98 84]
Reshaped 5x3 matrix:
[[48  1 60]
 [ 6 44 47]
 [ 5 68 90]
 [46 90 64]
 [37 98 84]]

**Question 3:**
You’re developing a DNA sequence comparison tool to find matching nucleotide pairs in two DNA sequences. Write a function **count_matching_pairs()** that accepts two DNA sequences as arguments and returns the count of positions where both sequences contain the same two-character nucleotide pairs. For example, if the inputs are **"ATGCCGTA"** and **"ATGTCGTT"**, the function should return 3, as the two-character pairs **"AT"**, **"GC"**, and **"GT"** appear in the same positions in both sequences.

**(Marks:5)**

In [4]:
# Q3
def count_matching_pairs(str1, str2):
    num = 0
    if len(str1) != len(str2):
        print("The sequences must have same length")
    for i in range(len(str1) - 1):
        if str1[i : i + 2] == str2[i : i + 2]:
            num = num + 1
    return num


str1 = "ATGCCGTA"
str2 = "ATGTCGTT"
ans = count_matching_pairs(str1, str2)
print(ans)

4

**Question 4:**
Create a DataFrame with columns Book, Price, and Stock:

Using boolean indexing, select books with a Price greater than $8 and create a new column called TotalValue that calculates the total stock value for each book (i.e., Price * Stock). Display the resulting DataFrame with reset indexes.

**(Marks: 4)**

In [5]:
# Q4
data = {
    "Book": ["Science", "Maths", "English", "Urdu"],
    "Price": [6.0, 15.5, 10.7, 7.5],
    "Stock": [12, 4, 15, 8],
}
df = pd.DataFrame(data)

new_df = df[df["Price"] > 8]
new_df["TotalValue"] = new_df["Price"] * new_df["Stock"]
result_df = new_df.reset_index(drop=True)
print(result_df)

      Book  Price  Stock  TotalValue
0    Maths   15.5      4        62.0
1  English   10.7     15       160.5

<ipython-input-5-477b93c8999b>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['TotalValue']=new_df['Price']*new_df['Stock']

**Question 5:**
Load the data file 'exam_data_1' and  'exam_data_2 'to a dataframe and display first 10 rows of the each dataset.

**(Marks:2)**

In [6]:
# Q5
df_1 = pd.read_csv("exam_data_1.csv")
df_2 = pd.read_csv("exam_data_2.csv")
print("\nFirst dataset: ", df_1)
print("\nSecond dataset: ", df_2)

First dataset:         Name   Age Date of Birth  Height (cm)  Weight (kg)   Salary
0     Alice  30.0      1/1/1994        165.0         60.0  $70,000
1       Bob   NaN      1/1/1999        175.5          NaN  $60,000
2   Charlie  35.0           NaN        180.2         80.0      NaN
3     David  28.0      1/1/1996        195.0         75.0  $65,000
4       Eva  22.0      1/1/2002        160.4         50.0      NaN
5     Frank  33.0      1/1/1989        172.0         65.0  $72,000
6      Gina  26.0           NaN        165.5          NaN  $58,000
7     Henry  29.0      1/1/1995        168.5         70.0      NaN
8       Ivy   NaN      1/1/2000        100.0         66.5  $63,000
9      Jack  25.0      1/1/1999        177.5         68.0  $59,000
10    Karen  27.0     5/15/1992        163.0         72.0  $62,000
11      Leo  32.0     3/22/1988        171.0         60.0  $85,000
12     Mona   NaN     7/12/1997        180.0         78.0      NaN
13     Nina  24.0           NaN          NaN          NaN  $54,000
14    Oscar  31.0    11/10/1991        160.5         63.0  $68,000
15     Paul  36.0      9/8/1990        220.0         90.0  $80,000
16   Quincy  29.0      1/5/1993        155.0         58.0      NaN
17   Rachel   NaN    12/25/2001        170.0          NaN  $60,000
18    Steve  34.0           NaN        185.0         85.0  $78,000
19     Tina  23.0     4/13/2003        178.5         67.0  $55,000

Second dataset:         Name  Department   Join Date   Salary       Location
0     Alice          HR  2020-02-01  $68,000       New York
1   Charlie     Finance  2019-05-15  $82,000        Chicago
2     David          IT  2021-09-10  $67,500  San Francisco
3     Frank   Marketing  2018-11-30  $75,000    Los Angeles
4     Henry       Sales  2020-12-10      NaN         Boston
5     Julia  Operations  2019-01-20  $55,000        Seattle
6       Ivy          IT  2018-03-10  $60,000         Austin
7     Kevin     Finance  2020-06-30      NaN         Denver
8     Laura   Marketing  2019-12-12  $62,000          Miami
9     Nancy          HR  2021-07-01  $65,000         Dallas
10    Oscar          IT  2017-05-18  $72,500      San Diego
11     Paul       Sales  2022-03-21  $85,000        Orlando
12   Quincy     Finance  2020-08-14      NaN        Houston
13   Rachel          HR  2018-10-23  $70,000        Detroit
14    Steve   Marketing  2019-06-11  $77,000       Portland
15     Tina          IT  2020-09-19  $64,000        Phoenix
16      Uma       Sales  2019-02-27      NaN      Baltimore
17   Victor          HR  2018-12-05  $58,000        Atlanta
18    Wendy  Operations  2021-04-06  $59,000      Nashville
19   Xander     Finance  2019-03-08  $80,000      Cleveland

**Question 6:**

You have two datasets:

1.   **exam_data_1.csv** - Contains personal and physical attributes of employees, including columns:
**Name, Age, Date of Birth, Height (cm), Weight (kg), Salary**
2.   **exam_data_2.csv** - Contains professional details of employees, including columns:
**Name, Department, Join Date, Salary, Location**


Write a Python program to:

**1)**Load both datasets into separate DataFrames.

**2)**Merge the two DataFrames on the Name column to create a combined DataFrame that includes all records from both datasets, even if an employee is missing from one of them (use an outer join).

**3)**Finally, display the merged DataFrame.

**(Marks: 5)**

In [7]:
# Q6
df_1 = pd.read_csv("exam_data_1.csv")
df_2 = pd.read_csv("exam_data_2.csv")

merged_data = pd.merge(df_1, df_2, on="Name", how="outer")
merged_data.to_csv("merged_dataset.csv")
print(merged_data)

       Name   Age Date of Birth  Height (cm)  Weight (kg) Salary_x  \
0     Alice  30.0      1/1/1994        165.0         60.0  $70,000
1       Bob   NaN      1/1/1999        175.5          NaN  $60,000
2   Charlie  35.0           NaN        180.2         80.0      NaN
3     David  28.0      1/1/1996        195.0         75.0  $65,000
4       Eva  22.0      1/1/2002        160.4         50.0      NaN
5     Frank  33.0      1/1/1989        172.0         65.0  $72,000
6      Gina  26.0           NaN        165.5          NaN  $58,000
7     Henry  29.0      1/1/1995        168.5         70.0      NaN
8       Ivy   NaN      1/1/2000        100.0         66.5  $63,000
9      Jack  25.0      1/1/1999        177.5         68.0  $59,000
10    Karen  27.0     5/15/1992        163.0         72.0  $62,000
11      Leo  32.0     3/22/1988        171.0         60.0  $85,000
12     Mona   NaN     7/12/1997        180.0         78.0      NaN
13     Nina  24.0           NaN          NaN          NaN  $54,000
14    Oscar  31.0    11/10/1991        160.5         63.0  $68,000
15     Paul  36.0      9/8/1990        220.0         90.0  $80,000
16   Quincy  29.0      1/5/1993        155.0         58.0      NaN
17   Rachel   NaN    12/25/2001        170.0          NaN  $60,000
18    Steve  34.0           NaN        185.0         85.0  $78,000
19     Tina  23.0     4/13/2003        178.5         67.0  $55,000
20    Julia   NaN           NaN          NaN          NaN      NaN
21    Kevin   NaN           NaN          NaN          NaN      NaN
22    Laura   NaN           NaN          NaN          NaN      NaN
23    Nancy   NaN           NaN          NaN          NaN      NaN
24      Uma   NaN           NaN          NaN          NaN      NaN
25   Victor   NaN           NaN          NaN          NaN      NaN
26    Wendy   NaN           NaN          NaN          NaN      NaN
27   Xander   NaN           NaN          NaN          NaN      NaN

    Department   Join Date Salary_y       Location
0           HR  2020-02-01  $68,000       New York
1          NaN         NaN      NaN            NaN
2      Finance  2019-05-15  $82,000        Chicago
3           IT  2021-09-10  $67,500  San Francisco
4          NaN         NaN      NaN            NaN
5    Marketing  2018-11-30  $75,000    Los Angeles
6          NaN         NaN      NaN            NaN
7        Sales  2020-12-10      NaN         Boston
8           IT  2018-03-10  $60,000         Austin
9          NaN         NaN      NaN            NaN
10         NaN         NaN      NaN            NaN
11         NaN         NaN      NaN            NaN
12         NaN         NaN      NaN            NaN
13         NaN         NaN      NaN            NaN
14          IT  2017-05-18  $72,500      San Diego
15       Sales  2022-03-21  $85,000        Orlando
16     Finance  2020-08-14      NaN        Houston
17          HR  2018-10-23  $70,000        Detroit
18   Marketing  2019-06-11  $77,000       Portland
19          IT  2020-09-19  $64,000        Phoenix
20  Operations  2019-01-20  $55,000        Seattle
21     Finance  2020-06-30      NaN         Denver
22   Marketing  2019-12-12  $62,000          Miami
23          HR  2021-07-01  $65,000         Dallas
24       Sales  2019-02-27      NaN      Baltimore
25          HR  2018-12-05  $58,000        Atlanta
26  Operations  2021-04-06  $59,000      Nashville
27     Finance  2019-03-08  $80,000      Cleveland

**Question 7:** Use both the **Interquartile Range (IQR)** method and the **Z-score** method to identify outliers in the Weight (kg) column. Show the steps used to calculate the IQR and the bounds for identifying outliers using both methods. List the names and weights of any outliers you find.**(5 Marks)**

Explain why they are considered outliers.

In [8]:
# Q7
df = pd.DataFrame(merged_data)

# IQR Method
q1 = df["Weight (kg)"].quantile(0.25)
q3 = df["Weight (kg)"].quantile(0.75)
IQR = q3 - q1

# IQR Method
iqr_outliers = df[
    (df["Weight (kg)"] < q1 - 1.5 * IQR) | (df["Weight (kg)"] > q3 + 1.5 * IQR)
]
print("Outliers using IQR method:")
print(iqr_outliers[["Name", "Weight (kg)"]])

# Z-score Method
df["Z-score"] = stats.zscore(df["Weight (kg)"])
z_score_outliers = df[(df["Z-score"] < -3) | (df["Z-score"] > 3)]
print("Outliers using Z-score method:")
print(z_score_outliers[["Name", "Weight (kg)"]])

Outliers using IQR method:
Empty DataFrame
Columns: [Name, Weight (kg)]
Index: []
Outliers using Z-score method:
Empty DataFrame
Columns: [Name, Weight (kg)]
Index: []

**Question 8:**
Using the merged dataset created from **dataset1_expanded.csv** and **dataset2_expanded.csv**, write a Python program to handle missing values effectively.

**Perform the following steps:**


1.  **Drop Rows with Missing Values:** Create a DataFrame from the merged dataset that excludes any rows with missing values in any column, and display the result.
2.   **Fill Missing Values:**


*   For numerical columns (Age, Height (cm), Weight (kg)), replace missing values with the mean of each respective column
*   For categorical columns (Department, Location), replace missing values with the most frequent value in that column.
*   Display the resulting DataFrame after applying these methods.


3.   **Forward Fill Remaining Missing Values:** Use forward filling to fill in any remaining missing values, and display the final DataFrame.
**(Marks: 6)**

In [9]:
# Q8
merged_df = pd.read_csv("merged_dataset.csv")
df_1 = merged_df.dropna()
print("DataFrame after dropping rows with missing values:")
print(df_1)

num_cols = ["Age", "Height (cm)", "Weight (kg)"]
for col in num_cols:
    merged_df[col].fillna(merged_df[col].mean(), inplace=True)

cat_cols = ["Department", "Location"]
for col in cat_cols:
    merged_df[col].fillna(merged_df[col].mode()[0], inplace=True)

print("DataFrame after missing values fill:")
print(merged_df)
merged_df.ffill(inplace=True)

print("Final DataFrame after forward filling remaining missed values:")
print(merged_df)

DataFrame after dropping rows with missing values:
    Unnamed: 0   Name   Age Date of Birth  Height (cm)  Weight (kg) Salary_x  \
0            0  Alice  30.0      1/1/1994        165.0         60.0  $70,000
3            3  David  28.0      1/1/1996        195.0         75.0  $65,000
5            5  Frank  33.0      1/1/1989        172.0         65.0  $72,000
14          14  Oscar  31.0    11/10/1991        160.5         63.0  $68,000
15          15   Paul  36.0      9/8/1990        220.0         90.0  $80,000
19          19   Tina  23.0     4/13/2003        178.5         67.0  $55,000

   Department   Join Date Salary_y       Location
0          HR  2020-02-01  $68,000       New York
3          IT  2021-09-10  $67,500  San Francisco
5   Marketing  2018-11-30  $75,000    Los Angeles
14         IT  2017-05-18  $72,500      San Diego
15      Sales  2022-03-21  $85,000        Orlando
19         IT  2020-09-19  $64,000        Phoenix
DataFrame after missing values fill:
    Unnamed: 0     Name   Age Date of Birth  Height (cm)  Weight (kg)  \
0            0    Alice  30.0      1/1/1994   165.000000     60.00000
1            1      Bob  29.0      1/1/1999   175.500000     69.21875
2            2  Charlie  35.0           NaN   180.200000     80.00000
3            3    David  28.0      1/1/1996   195.000000     75.00000
4            4      Eva  22.0      1/1/2002   160.400000     50.00000
5            5    Frank  33.0      1/1/1989   172.000000     65.00000
6            6     Gina  26.0           NaN   165.500000     69.21875
7            7    Henry  29.0      1/1/1995   168.500000     70.00000
8            8      Ivy  29.0      1/1/2000   100.000000     66.50000
9            9     Jack  25.0      1/1/1999   177.500000     68.00000
10          10    Karen  27.0     5/15/1992   163.000000     72.00000
11          11      Leo  32.0     3/22/1988   171.000000     60.00000
12          12     Mona  29.0     7/12/1997   180.000000     78.00000
13          13     Nina  24.0           NaN   170.663158     69.21875
14          14    Oscar  31.0    11/10/1991   160.500000     63.00000
15          15     Paul  36.0      9/8/1990   220.000000     90.00000
16          16   Quincy  29.0      1/5/1993   155.000000     58.00000
17          17   Rachel  29.0    12/25/2001   170.000000     69.21875
18          18    Steve  34.0           NaN   185.000000     85.00000
19          19     Tina  23.0     4/13/2003   178.500000     67.00000
20          20    Julia  29.0           NaN   170.663158     69.21875
21          21    Kevin  29.0           NaN   170.663158     69.21875
22          22    Laura  29.0           NaN   170.663158     69.21875
23          23    Nancy  29.0           NaN   170.663158     69.21875
24          24      Uma  29.0           NaN   170.663158     69.21875
25          25   Victor  29.0           NaN   170.663158     69.21875
26          26    Wendy  29.0           NaN   170.663158     69.21875
27          27   Xander  29.0           NaN   170.663158     69.21875

   Salary_x  Department   Join Date Salary_y       Location
0   $70,000          HR  2020-02-01  $68,000       New York
1   $60,000     Finance         NaN      NaN        Atlanta
2       NaN     Finance  2019-05-15  $82,000        Chicago
3   $65,000          IT  2021-09-10  $67,500  San Francisco
4       NaN     Finance         NaN      NaN        Atlanta
5   $72,000   Marketing  2018-11-30  $75,000    Los Angeles
6   $58,000     Finance         NaN      NaN        Atlanta
7       NaN       Sales  2020-12-10      NaN         Boston
8   $63,000          IT  2018-03-10  $60,000         Austin
9   $59,000     Finance         NaN      NaN        Atlanta
10  $62,000     Finance         NaN      NaN        Atlanta
11  $85,000     Finance         NaN      NaN        Atlanta
12      NaN     Finance         NaN      NaN        Atlanta
13  $54,000     Finance         NaN      NaN        Atlanta
14  $68,000          IT  2017-05-18  $72,500      San Diego
15  $80,000       Sales  2022-03-21  $85,000        Orlando
16      NaN     Finance  2020-08-14      NaN        Houston
17  $60,000          HR  2018-10-23  $70,000        Detroit
18  $78,000   Marketing  2019-06-11  $77,000       Portland
19  $55,000          IT  2020-09-19  $64,000        Phoenix
20      NaN  Operations  2019-01-20  $55,000        Seattle
21      NaN     Finance  2020-06-30      NaN         Denver
22      NaN   Marketing  2019-12-12  $62,000          Miami
23      NaN          HR  2021-07-01  $65,000         Dallas
24      NaN       Sales  2019-02-27      NaN      Baltimore
25      NaN          HR  2018-12-05  $58,000        Atlanta
26      NaN  Operations  2021-04-06  $59,000      Nashville
27      NaN     Finance  2019-03-08  $80,000      Cleveland
Final DataFrame after forward filling remaining missed values:
    Unnamed: 0     Name   Age Date of Birth  Height (cm)  Weight (kg)  \
0            0    Alice  30.0      1/1/1994   165.000000     60.00000
1            1      Bob  29.0      1/1/1999   175.500000     69.21875
2            2  Charlie  35.0      1/1/1999   180.200000     80.00000
3            3    David  28.0      1/1/1996   195.000000     75.00000
4            4      Eva  22.0      1/1/2002   160.400000     50.00000
5            5    Frank  33.0      1/1/1989   172.000000     65.00000
6            6     Gina  26.0      1/1/1989   165.500000     69.21875
7            7    Henry  29.0      1/1/1995   168.500000     70.00000
8            8      Ivy  29.0      1/1/2000   100.000000     66.50000
9            9     Jack  25.0      1/1/1999   177.500000     68.00000
10          10    Karen  27.0     5/15/1992   163.000000     72.00000
11          11      Leo  32.0     3/22/1988   171.000000     60.00000
12          12     Mona  29.0     7/12/1997   180.000000     78.00000
13          13     Nina  24.0     7/12/1997   170.663158     69.21875
14          14    Oscar  31.0    11/10/1991   160.500000     63.00000
15          15     Paul  36.0      9/8/1990   220.000000     90.00000
16          16   Quincy  29.0      1/5/1993   155.000000     58.00000
17          17   Rachel  29.0    12/25/2001   170.000000     69.21875
18          18    Steve  34.0    12/25/2001   185.000000     85.00000
19          19     Tina  23.0     4/13/2003   178.500000     67.00000
20          20    Julia  29.0     4/13/2003   170.663158     69.21875
21          21    Kevin  29.0     4/13/2003   170.663158     69.21875
22          22    Laura  29.0     4/13/2003   170.663158     69.21875
23          23    Nancy  29.0     4/13/2003   170.663158     69.21875
24          24      Uma  29.0     4/13/2003   170.663158     69.21875
25          25   Victor  29.0     4/13/2003   170.663158     69.21875
26          26    Wendy  29.0     4/13/2003   170.663158     69.21875
27          27   Xander  29.0     4/13/2003   170.663158     69.21875

   Salary_x  Department   Join Date Salary_y       Location
0   $70,000          HR  2020-02-01  $68,000       New York
1   $60,000     Finance  2020-02-01  $68,000        Atlanta
2   $60,000     Finance  2019-05-15  $82,000        Chicago
3   $65,000          IT  2021-09-10  $67,500  San Francisco
4   $65,000     Finance  2021-09-10  $67,500        Atlanta
5   $72,000   Marketing  2018-11-30  $75,000    Los Angeles
6   $58,000     Finance  2018-11-30  $75,000        Atlanta
7   $58,000       Sales  2020-12-10  $75,000         Boston
8   $63,000          IT  2018-03-10  $60,000         Austin
9   $59,000     Finance  2018-03-10  $60,000        Atlanta
10  $62,000     Finance  2018-03-10  $60,000        Atlanta
11  $85,000     Finance  2018-03-10  $60,000        Atlanta
12  $85,000     Finance  2018-03-10  $60,000        Atlanta
13  $54,000     Finance  2018-03-10  $60,000        Atlanta
14  $68,000          IT  2017-05-18  $72,500      San Diego
15  $80,000       Sales  2022-03-21  $85,000        Orlando
16  $80,000     Finance  2020-08-14  $85,000        Houston
17  $60,000          HR  2018-10-23  $70,000        Detroit
18  $78,000   Marketing  2019-06-11  $77,000       Portland
19  $55,000          IT  2020-09-19  $64,000        Phoenix
20  $55,000  Operations  2019-01-20  $55,000        Seattle
21  $55,000     Finance  2020-06-30  $55,000         Denver
22  $55,000   Marketing  2019-12-12  $62,000          Miami
23  $55,000          HR  2021-07-01  $65,000         Dallas
24  $55,000       Sales  2019-02-27  $65,000      Baltimore
25  $55,000          HR  2018-12-05  $58,000        Atlanta
26  $55,000  Operations  2021-04-06  $59,000      Nashville
27  $55,000     Finance  2019-03-08  $80,000      Cleveland

**Question 9:**
Using the merged dataset created from dataset1_expanded.csv and dataset2_expanded.csv, perform the following data type conversions:

1. Convert the data type of the Date of Birth column to DateTime format.
2. Convert the data type of the Weight (kg) column to integer.
3. Verifies and displays the data types of the Date of Birth and Weight (kg) columns after conversion.
**(Marks: 5)**

In [10]:
# Q9
new_df = pd.read_csv("merged_dataset.csv")
new_df["Date of Birth"] = pd.to_datetime(new_df["Date of Birth"])
new_df["Weight (kg)"] = pd.to_numeric(new_df["Weight (kg)"])
print(new_df[["Date of Birth", "Weight (kg)"]].dtypes)

Date of Birth    datetime64[ns]
Weight (kg)             float64
dtype: object